# WoodRayEllipseRadiusX Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
AdvancedWood..::..WoodRayEllipseRadiusX Property
AdvancedWood Class See Also
---
The property labeled "Radius (cm) along the longer axis of ray ellipse" from the "AdvancedWood" schema.
**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2018.1
# Syntax
C#
---
```text
public static string WoodRayEllipseRadiusX { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property WoodRayEllipseRadiusX As String
	Get
```

Visual C++
---
```text
public:
static property String^ WoodRayEllipseRadiusX {
	String^ get ();
}
```

# Remarks
This property is of type "AssetPropertyDistance".
# See Also
AdvancedWood Class
Autodesk.Revit.DB.Visual Namespace